PH_data/alpha_0.9/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
16537
(
( 2.360114013e-05 -1.202309522e-05 1.428183936e-07 2.725971717e-05 -1.140624306e-07 2.362623673e-05 )
( 2.293583384e-05 -1.109388359e-05 8.184116496e-09 2.658348967e-05 -1.071566089e-07 2.352153388e-05 )
( 2.433513691e-05 -1.265978153e-05 7.36989989e-07 2.573659913e-05 -1.798052409e-07 2.192262764e-05 )
( 2.266426418e-05 -1.037130369e-05 -5.921258861e-08 2.597995262e-05 -1.160178726e-07 2.351773946e-05 )
( 2.370334005e-05 -1.204764612e-05 6.288120744e-07 2.547864278e-05 -1.516854411e-07 2.15085056e-05 )
( 2.458102426e-05 -1.269088898e-05 1.081452638e-06 2.38632565e-05 -2.710061153e-07 2.077817408e-05 )
( 2.253456296e-05 -9.761690308e-06 -7.581446937e-08 2.513996333e-05 -1.393639764e-07 2.354419667e-05 )
( 2.318598854e-05 -1.139011692e-05 5.165996413e-07 2.514132757e-05 -1.419336968e-07 2.11517945e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
