PH_data/alpha_0.9/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
16537
(
( 0.02778055333 0.002478665207 7.827263471e-05 )
( 0.02791909501 0.00215768395 7.755997649e-05 )
( 0.02791022509 0.00227702572 6.998819299e-05 )
( 0.02803001553 0.001837832853 7.76953384e-05 )
( 0.02805277705 0.002022795146 7.448853285e-05 )
( 0.0280995667 0.002106366679 7.02262696e-05 )
( 0.02809598297 0.001563771977 7.53101267e-05 )
( 0.02818420157 0.001745295594 7.815686695e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
