PH_data/alpha_0.9/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/




FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    hill
    {
        type            wall;
        inGroups        1(wall);
        nFaces          812;
        startFace       32939;
    }
    top-wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          162;
        startFace       33751;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16537;
        startFace       33913;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16537;
        startFace       50450;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          45;
        startFace       66987;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  cyclicAMI_inlet;
        separationVector ( -8.1 0 0 );
        lowWeightCorrection 0.01;
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        inGroups        1(cyclicAMI);
        nFaces          45;
        startFace       67032;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  cyclicAMI_outlet;
        separationVector ( 8.1 0 0 );
        lowWeightCorrection 0.01;
    }
)

// ************************************************************************* //
